
INSERT INTO category_table (category_name)
values ('Компьютерная техника');
INSERT INTO category_table (category_name)
values ('Телефоны');


INSERT INTO product_table(name, price, image, description, category_id)
VALUES ('Ноутбук Sony Vaio VPC-YB2L1R', 20000, '1.png', 'Для учебы', 1),
       ('Ноутбук Acer Nitro AN517-57', 115850, '2.jpg', 'Для игр', 1),
       ('Ноутбук Acer Aspire 5 Slim', 47960, '3.jpg', 'Для учебы', 1),
       ('Ноутбук Lenovo Ideapad 3', 15000, '4.jpg', 'Для учебы', 1),
       ('Ноутбук Asus TUF Dash F15 FX516PE', 114450, '5.png', 'Операционная система: 10; Процессор: Intel Core  i7-11370H;', 1),
       ('Ноутбук Acer Swift 3', 79000, '6.jpg', 'Ноутбук Acer Swift 3 – отличный выбор для работы дома, в офисе или вне помещений. Встроенный аккумулятор способен обеспечить до 8 часов работы без подзарядки. Двухдиапазонный модуль WI-Fi ac позволит выходить в интернет на высоких скоростях в кафе, гипермаркетах и других общественных местах, где есть точка доступа.', 1),
       ('Ноутбук MSI Katana GF66', 139750, '7.png', 'Настоящим воинам будущего требуется ноутбук, готовый справиться с любыми неприятностями. MSI GL76 11UDK-234RU подходит на эту роль, предоставляя в твоё распоряжение мощную начинку и корпус с запоминающимся дизайном, к созданию которого привлекли бельгийского художника Маартена Верховена.', 1),
       ('Ноутбук Asus ROG Strix G14', 128210 , '8.jpg', 'Основу аппаратной платформы ноутбукаApple  составляют четырехъядерный процессор Intel Core i7 1185G7, видеокарта Nvidia GeForce MX450 и 16 Гб оперативной памяти.', 1),
       ('Ноутбук Asus Vivobook Pro 14X', 123200, '9.jpg', 'Игровой ноутбук Asus Vivobook оборудован видеокартой GeForce RTX 3050 c 4 Гб памяти, позволяющей запускать современные игры с оптимальными настройками. Она создана на базе архитектуры Ampere и поддерживает технологию DLSS, способную повысить производительность в требовательных новинках.', 1),
       ('Ноутбук Asus ROG Strix G15', 123000, '10.jpg', 'Asus N7600PC-KV116W — ноутбук из серии Vivabook Pro. Его характерная особенность — 16-дюймовый экран, созданный на базе матрицы OLED. Разрешение дисплея составляет 2560 х 1600 пикселей, на его поверхности есть матовое антибликовое покрытие.', 1),
       ('Ноутбук Dell Alienware M15 R6', 122000, '11.jpg', 'Дизайн игрового ноутбука MSI Katana GF66 11UE-655RU воплощает в жизнь идеи знаменитого японского иллюстратора Цуеси Нагано, создавшего обложки для сериала Romance of the Three Kingdoms.', 1),
       ('Ноутбук Asus TUF Gaming F15', 118000, '12.jpg', 'Лэптоп использует шестиядерный процессор Intel Core i5 11400H, видеокарту GeForce RTX 3060 с 6 Гб памяти, а также 16 Гб оперативной памяти DDR4, работающей на частоте 3200 МГц. Модель оснащена SSD-накопителем емкостью 512 Гб и геймерской клавиатурой с красной подсветкой, цифровым блоком и тактильной обратной связью.', 1),
       ('Ноутбук Acer Nitro AN515-57', 119000, '13.jpg', '15,6-дюймовый экран с поддержкой разрешения Full HD и матовой поверхностью демонстрирует частоту обновления 144 Гц. Система охлаждения Cooler Boost 5 включает в себя два крупных вентилятора, шесть широких тепловых трубок, отдельные термомодули для охлаждения графического и центрального процессора.', 1),
       ('Ноутбук Dell Inspiron 17 7000', 105000, '14.jpg', 'Игровой ноутбук HP Victus 16-d0001ur подходит для ААА-блокбастеров с продвинутой графикой благодаря видеокарте GeForce RTX 3060. Графический адаптер принадлежит к семейству Ampere, обладает улучшенными тензорными и RT-ядрами по сравнению с предшественниками. Благодаря этому девайс поддерживает технологию DLSS и трассировку лучей в реальном времени.', 1),
       ('Ноутбук Vivobook Pro 15 OLED', 123200, '15.jpg', 'Детализированное изображение выводится на 16,1-дюймовый экран с разрешением Full HD и IPS-матрицей. Для сетевых шутеров и других игр с быстрым геймплеем пригодится частота разверстки 144 Гц, за счет чего самые динамичные сцены смотрятся максимально плавно. Внутри HP Victus 16-d0001ur находится восьмиядерный процессор Intel Core i7 11800H, 16 Гб оперативной памяти и скоростной SSD-накопитель емкостью 1 Тб.', 1),
       ('Ноутбук MSI GL66 Pulse', 186000, '16.jpg', 'Доступ в интернет может быть как беспроводным, с помощью модуля Wi-Fi, так и кабельным, через разъем LAN. Предусмотрена поддержка Bluetooth 5.1. За взаимодействие с геймерской и прочей периферией отвечают выход HDMI и порты USB типа A и C.', 1),
       ('Ноутбук Asus X409F', 40000, '17.jpeg', 'Диагональ экрана, выполненного по технологии IPS, составляет 17,3 дюйма. Его разрешение — 1920 х 1080 пикселей, частота обновления — 144 Гц. При ярком освещении блики не искажают изображение благодаря специальному матовому покрытию.', 1);





